const config = require('../config')
const {cmd , commands} = require('../command')
const os = require("os")
const {runtime} = require('../lib/functions')

cmd({
    pattern: "menu111",
    alias: ["list11"],
    desc: "menu the bot",
    react: "📜",
    category: "main"
},
async (conn, mek, m, { from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply }) => {
    try {
        let desc = `*👋 හායි ${pushname}ඔයාට කොහමද?😘🥰*

> *╭─「🐉𝐇𝐀𝐒𝐇𝐈 𝐌𝐄𝐍𝐔 𝐋𝐈𝐒𝐓🐉」*
> *│ 🔥 ʀᴜɴᴛɪᴍᴇ : ${runtime(process.uptime())}*
> *│ 🔥 ʀᴀᴍ ᴜꜱᴀɢᴇ : ${(process.memoryUsage().heapUsed / 1024 / 1024).toFixed(2)}MB / ${Math.round(require('os').totalmem / 1024 / 1024)}MB*
> *│ 🔥 ᴘʟᴀᴛꜰᴏʀᴍ : ${os.hostname()}*
> *│ 🔥 ᴠᴇʀꜱɪᴏɴ : 1.0*
> *╰──────────●●*
*🩸⃟༑⌁𝐐𝐔𝐄𝐄𝐍 𝐇𝐀𝐒𝐇𝐈 𝐌𝐃梨🐉*
> ╭━━━━━━━━━━━★✼☆
> │➤ 𝟏     ║  *𝐎𝐖𝐍𝐄𝐑*
> │➤ 𝟐     ║  *𝐂𝐎𝐍𝐕𝐄𝐑𝐓*
> │➤ 𝟑     ║  *𝐀𝐈*
> │➤ 𝟒     ║  *𝐒𝐄𝐀𝐑𝐂𝐇*
> │➤ 𝟓     ║  *𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃*
> │➤ 𝟔     ║  *𝐌𝐀𝐈𝐍*
> │➤ 𝟕     ║  *𝐆𝐑𝐎𝐔𝐏*
> │➤ 𝟖     ║  *𝐅𝐔𝐍*
> │➤ 𝟗     ║  *𝐌𝐎𝐕𝐈𝐄*
> │➤ 𝟏𝟎   ║  *𝐎𝐓𝐇𝐄𝐑*
> ╰•★★━━━━━━━━★★•╯

*┕ 🔢𝐑𝐞𝐩𝐥𝐲 𝐰𝐢𝐭𝐡 𝐭𝐡𝐞 𝐧𝐮𝐦𝐛𝐞𝐫 𝐲𝐨𝐮 𝐰𝐚𝐧𝐭. ʕʘ̅͜ʘ̅ʔ*

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`;

        const vv = await conn.sendMessage(from, { image: { url: "https://i.imgur.com/JurU8ZF.jpeg"}, caption: desc }, { quoted: mek });

        conn.ev.on('messages.upsert', async (msgUpdate) => {
            const msg = msgUpdate.messages[0];
            if (!msg.message || !msg.message.extendedTextMessage) return;

            const selectedOption = msg.message.extendedTextMessage.text.trim();

            if (msg.message.extendedTextMessage.contextInfo && msg.message.extendedTextMessage.contextInfo.stanzaId === vv.key.id) {
                switch (selectedOption) {
                    case '1':
                        reply(`*❒⁠⁠⁠⁠ 👨‍💻 OWNER-CMD 👨‍💻 ❒*
 ╭────────━★✼☆｡
 │ 🐉 *setting* 
 ╰────────────────────━★✼☆｡
 ╭────────━★✼☆｡
 │ 🐉 *mysetting* 
 ╰────────────────────━★✼☆｡
 ╭────────━★✼☆｡
 │ 🐉 *block* 
 ╰────────────────────━★✼☆｡
 ╭────────━★✼☆｡
 │ 🐉 *unblock* 
 ╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *restart* 
╰────────────────────━★✼☆｡
> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);
                        break;
                    case '2':               
                        reply(`*❒🎡 CONVERTER-CMD 🎡❒*

╭────────━★✼☆｡
│ 🐉 *sticker* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *tts* 
╰────────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);
                        break;
                    case '3':               
                        reply(`*❒⁠⁠⁠⁠ 🧠 AI-CMD 🧠 ❒⁠⁠⁠⁠*

╭────────━★✼☆｡
│ 🐉 *ai* 
╰────────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);
                        break;
                    case '4':               
                        reply(`*❒⁠⁠⁠⁠ 🔎 SEARCH-CMD 🔍 ❒⁠⁠⁠⁠ *

╭────────━★✼☆｡
│ 🐉 *yts* 
╰──────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *define* 
╰──────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *font* 
╰──────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *derana* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *weather* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *githubstalk* 
╰────────────────────━★✼☆｡
╭────────●●►
│ 🐉 *movie* 
╰────────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);
                        break;
                    case '5':               
                        reply(`*❒⁠⁠⁠⁠ 📥 DOWNLOADER-CMD 📥 ❒*

╭────────━★✼☆｡
│ 🐉 *apk* 
╰────────────────────━★✼☆｡
╭───────━★✼☆｡
│ 🐉 *twitter* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *gdrive* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *mediafire* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *fb* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *ig* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *hashi/sinhalasub* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *song* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *video* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *play/yt* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *ginisisila* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *baiscope* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *img* 
╰────────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);
                        break;
                    case '6':               
                        reply(`*❒⁠⁠⁠⁠ 🗝️ MAIN COMMAND LIST 🗝️⁠⁠❒⁠⁠⁠⁠ *

╭────────━★✼☆｡
│ 🐉 *alive* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *about* 
╰───────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *menu* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *allmenu* 
╰───────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *support* 
╰───────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *system* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *ping* 
╰───────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *runtime* 
╰────────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);
                        break;
                    case '7':               
                        reply(`❒⁠⁠⁠⁠ 👥 GROUP-CMD 👥 ❒⁠⁠⁠⁠ *

╭────────━★✼☆｡
│ 🐉 *closetime* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *opentime* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *tagall* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *admins* 
╰───────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *grouplink* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *groupdesc* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *groupinfo* 
╰────────────────────━★✼☆｡
╭───────━★✼☆｡
│ 🐉 *gname* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *welcome* 
╰───────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *setsubject* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *request* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *accept* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *reject* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *kick* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *add* 
╰────────────────────━★✼☆｡
╭────────●●►
│ 🐉 *unlock* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *lock* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *apove* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *getpic* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *kickall* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *mute* 
╰───────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);
                       break;
                    case '8':               
                        reply(`*◈╾──────FUN COMMAND LIST──────╼◈*

╭────────━★✼☆｡
│ 🐉 *loli* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *waifu* 
╰────────────────────━★✼☆｡
╭───────━★✼☆｡
│ 🐉 *hack* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *maid* 
╰───────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *awoo* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *request* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *megumin* 
╰────────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);

                     break;
                    case '9':               
                        reply(`*❒⁠⁠⁠⁠ 📽️ MOVIE CMD 📽️ ❒⁠⁠⁠⁠*

╭────────━★✼☆｡
│ 🐉 *baiscope* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *ginisisila* 
╰────────────────────━★✼☆｡
╭───────━★✼☆｡
│ 🐉 *sinhalasub* 
╰────────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);

                        break;
                    case '10':               
                        reply(`*❒⁠⁠⁠⁠ 🌐 OTHER-CMD 🌐 ❒⁠⁠⁠⁠*

╭────────━★✼☆｡
│ 🐉 *readmore* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *about* 
╰────────────────────━★✼☆｡
╭────────━★✼☆｡
│ 🐉 *repo* 
╰───────────────────━★✼☆｡

> *⚜️𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐁𝐲 : ®𝐌𝐑 𝐋𝐀𝐊𝐒𝐈𝐃𝐔 🐉*`);


                        break;
                    default:
                        reply("Invalid option. Please select a valid option🔴");
                }

            }
        });

    } catch (e) {
        console.error(e);
        await conn.sendMessage(from, { react: { text: '❌', key: mek.key } })
        reply('An error occurred while processing your request.');
    }
});
